sample/app/controllers/blogs_controller.rb

  def index
    #テーブルからすべてのブログを取得
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def show
    #特定のブログの詳細画面を表示するアクション
    #属性がidのみのため、StrongParametersは使用する必要はなし
    #データを渡すためにインスタンス変数に代入
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    #Blog.create(title: params[:blog][:title], content: params[:blog][:content]) #モデルにDBの操作命令を出す(一つづつ記述する例)
    #Blog.create(params[:blog]) #マスアサインメント（カラムごとに記載しない方法）　米セキュリティ的に問題あり

    #Blog.create(params.require(:blog).permit(:title, :content)) #ストロングパラメーター

    @blog = Blog.create(blog_params)
---
INSERT INTO "blogs" ("title", "content") VALUES ($1, $2) RETURNING "id"  [["title", "あああ"], ["content", "いいい"]]

  def update
    @blog = Blog.find(params[:id])
    if @blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = $1, "content" = $2 WHERE "blogs"."id" = $3  [["title", "サンプル１"], ["content", "テスト２"], ["id", 8]]